Revit 2026 API

# PlanCircuitSetErase Method

---

Removes a specified object from the set.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual int Erase(
	PlanCircuit item
)
```
```vb
Public Overridable Function Erase (
	item As PlanCircuit
) As Integer
```
```cpp
public:
virtual int Erase(
	PlanCircuit^ item
)
```
```fsharp
abstract Erase :
        item : PlanCircuit -> int
override Erase :
        item : PlanCircuit -> int
```

#### Parameters

item PlanCircuit
    The item to be erased.

#### Return Value

Int32The number of items that were erased from the set.

#### Reference

PlanCircuitSet Class

Autodesk.Revit.DB Namespace